### Todo
Tujuan
- mengumpulkan seluruh data yang dibutuhkan;
- menilai kualitas dari data yang telah dikumpulkan; dan
- membersihkan data tersebut sehingga siap untuk dianalisi

Alur Latihan
- Tahap persiapan.
- Tahap gathering data.
- Tahap assessing data.
- Tahap cleaning data.

### Dataset

- https://www.kaggle.com/datasets/ruchi798/shopping-cart-database

### Library

In [3]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from tabulate import tabulate

### Gathering Data

In [4]:
customers_df = pd.read_csv("https://raw.githubusercontent.com/dicodingacademy/dicoding_dataset/main/DicodingCollection/customers.csv")
customers_df.head(2)

,customer_id,customer_name,gender,age,home_address,zip_code,city,state,country
0,1,fulan 1,Female,30,8606 Victoria TerraceSuite 560,5464,Johnstonhaven,Northern Territory,Australia
1,2,fulan 2,Prefer not to say,69,8327 Kirlin SummitApt. 461,8223,New Zacharyfort,South Australia,Australia

In [5]:
orders_df = pd.read_csv("https://raw.githubusercontent.com/dicodingacademy/dicoding_dataset/main/DicodingCollection/orders.csv")
orders_df.head(2)

   order_id  customer_id  payment order_date delivery_date
0         1           64    30811  2021-8-30    2021-09-24
1         2          473    50490   2021-2-3    2021-02-13

In [6]:
product_df = pd.read_csv("https://raw.githubusercontent.com/dicodingacademy/dicoding_dataset/main/DicodingCollection/products.csv")
product_df.head(2)

,product_id,product_type,product_name,size,colour,price,quantity,description
0,0,Shirt,Oxford Cloth,XS,red,114,66,"A red coloured, XS sized, Oxford Cloth Shirt"
1,1,Shirt,Oxford Cloth,S,red,114,53,"A red coloured, S sized, Oxford Cloth Shirt"

In [7]:
sales_df = pd.read_csv("https://raw.githubusercontent.com/dicodingacademy/dicoding_dataset/main/DicodingCollection/sales.csv")
sales_df.head(2)

   sales_id  order_id  product_id  price_per_unit  quantity  total_price
0         0         1         218             106         2        212.0
1         1         1         481             118         1        118.0

### Assessing Data

#### Menilai Data customers_df

In [8]:
customers_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1007 entries, 0 to 1006
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   customer_id    1007 non-null   int64
 1   customer_name  1007 non-null   object
 2   gender         989 non-null    object
 3   age            1007 non-null   int64
 4   home_address   1007 non-null   object
 5   zip_code       1007 non-null   int64
 6   city           1007 non-null   object
 7   state          1007 non-null   object
 8   country        1007 non-null   object
dtypes: int64(3), object(6)
memory usage: 70.9+ KB

In [9]:
customers_df.isna().sum()

customer_id       0
customer_name     0
gender           18
age               0
home_address      0
zip_code          0
city              0
state             0
country           0
dtype: int64

In [10]:
print("Jumlah duplikasi: ", customers_df.duplicated().sum())

Jumlah duplikasi:  6

In [11]:
customers_df.describe()
# terdapat keanehan pada nilai maksimum yang terdapat pada kolom age. Ini kemungkinan besar terjadi karena adanya inaccurate value pada kolom tersebut. (Max Age 700)

       customer_id          age     zip_code
count  1007.000000  1007.000000  1007.000000
mean    501.726912    50.929494  5012.538232
std     288.673238    30.516299  2885.836112
min       1.000000    20.000000     2.000000
25%     252.500000    34.000000  2403.500000
50%     502.000000    50.000000  5087.000000
75%     751.500000    65.000000  7493.500000
max    1000.000000   700.000000  9998.000000

#### Menilai Data orders_df

In [12]:
orders_df.info()
# Terdapat kesalahan tipe data untuk kolom order_date & delivery_date.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   order_id       1000 non-null   int64
 1   customer_id    1000 non-null   int64
 2   payment        1000 non-null   int64
 3   order_date     1000 non-null   object
 4   delivery_date  1000 non-null   object
dtypes: int64(3), object(2)
memory usage: 39.2+ KB

In [13]:
print(orders_df.isna().sum())
print("\nJumlah duplikasi: ",orders_df.duplicated().sum())
orders_df.describe()

order_id         0
customer_id      0
payment          0
order_date       0
delivery_date    0
dtype: int64

Jumlah duplikasi:  0

          order_id  customer_id       payment
count  1000.000000  1000.000000   1000.000000
mean    500.500000   506.640000  33972.936000
std     288.819436   277.115502  14451.609047
min       1.000000     1.000000  10043.000000
25%     250.750000   275.250000  21329.250000
50%     500.500000   515.000000  33697.500000
75%     750.250000   737.250000  46249.000000
max    1000.000000  1000.000000  59910.000000

#### Menilai Data product_df

In [14]:
product_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1266 entries, 0 to 1265
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   product_id    1266 non-null   int64
 1   product_type  1266 non-null   object
 2   product_name  1266 non-null   object
 3   size          1266 non-null   object
 4   colour        1266 non-null   object
 5   price         1266 non-null   int64
 6   quantity      1266 non-null   int64
 7   description   1266 non-null   object
dtypes: int64(3), object(5)
memory usage: 79.2+ KB

In [15]:
print(product_df.isna().sum())
print("\nJumlah duplikasi: ", product_df.duplicated().sum())
product_df.describe()

product_id      0
product_type    0
product_name    0
size            0
colour          0
price           0
quantity        0
description     0
dtype: int64

Jumlah duplikasi:  6

        product_id        price     quantity
count  1266.000000  1266.000000  1266.000000
mean    627.926540   105.812006    60.138231
std     363.971586     9.715611    11.682791
min       0.000000    90.000000    40.000000
25%     313.250000    95.250000    50.000000
50%     626.500000   109.000000    60.000000
75%     942.750000   114.000000    70.000000
max    1259.000000   119.000000    80.000000

#### Menilai Data sales_df

In [16]:
sales_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   sales_id        5000 non-null   int64
 1   order_id        5000 non-null   int64
 2   product_id      5000 non-null   int64
 3   price_per_unit  5000 non-null   int64
 4   quantity        5000 non-null   int64
 5   total_price     4981 non-null   float64
dtypes: float64(1), int64(5)
memory usage: 234.5 KB

In [17]:
print(sales_df.isna().sum())
print("\nJumlah duplikasi: ", sales_df.duplicated().sum())
sales_df.describe()

sales_id           0
order_id           0
product_id         0
price_per_unit     0
quantity           0
total_price       19
dtype: int64

Jumlah duplikasi:  0

,sales_id,order_id,product_id,price_per_unit,quantity,total_price
count,5000.000000,5000.000000,5000.000000,5000.000000,5000.00000,4981.000000
mean,2499.500000,503.038200,634.053200,103.501600,1.99240,206.307368
std,1443.520003,285.964418,363.255794,9.195004,0.80751,86.352449
min,0.000000,1.000000,1.000000,90.000000,1.00000,90.000000
25%,1249.750000,258.000000,323.000000,95.000000,1.00000,112.000000
50%,2499.500000,504.500000,635.000000,102.000000,2.00000,204.000000
75%,3749.250000,749.000000,951.000000,112.000000,3.00000,285.000000
max,4999.000000,999.000000,1259.000000,119.000000,3.00000,357.000000

### Cleaning Data

#### Membersihkan Data customers_df

In [18]:
# Menghilangkan duplicate data
print("Jumlah duplikasi: ", customers_df.duplicated().sum())
customers_df.drop_duplicates(inplace=True)
print("Jumlah duplikasi: ", customers_df.duplicated().sum())

Jumlah duplikasi:  6
Jumlah duplikasi:  0

In [19]:
# Menangani missing value

# Menampilak record dengan age NaN
# customers_df[customers_df.gender.isna()]

# Hitung record masing-masing kategori age
# customers_df.gender.value_counts()

# Imputasi dengan kategori "Prefer not to say"
print(customers_df[customers_df.gender.isna()].shape)
customers_df.fillna(value="Prefer not to say", inplace=True)
print(customers_df[customers_df.gender.isna()].shape)

(18, 9)
(0, 9)

In [20]:
# Menangani inaccurate value

# Mencari record dengan age 700
customers_df[customers_df.age == customers_df.age.max()]

print(tabulate(customers_df[customers_df.age == customers_df.age.max()]))
# Replace 70, karena hal ini karena human error
customers_df.age.replace(customers_df.age.max(), 70, inplace=True)
print(tabulate(customers_df[customers_df.age == customers_df.age.max()]))
# Replace 50, karena hal ini karena human error
customers_df.age.replace(customers_df.age.max(), 50, inplace=True)
print(tabulate(customers_df[customers_df.age == customers_df.age.max()]))

customers_df.describe()

---  ---  ---------  -----------------  ---  --------------------------  ----  ----------  ---------------  ---------
967  961  fulan 961  Prefer not to say  700  29 Farrell ParadeSuite 818  6528  New Joseph  South Australia  Australia
---  ---  ---------  -----------------  ---  --------------------------  ----  ----------  ---------------  ---------
---  ---  ---------  -----------------  ---  ----------------------  ----  ---------  ------------------  ---------
215  216  fulan 216  Prefer not to say  500  038 Haley MewsApt. 810  3991  Bayertown  Northern Territory  Australia
---  ---  ---------  -----------------  ---  ----------------------  ----  ---------  ------------------  ---------
---  ---  ---------  -----------------  --  ---------------------------------  ----  ---------------------  ------------------  ---------
 34   35  fulan 35   Male               80  3168 Bartoletti CrescentSuite 878   593  Port Lucas             Queensland          Australia
 38   39  fulan 39   Prefer not to say  80  7440 Cameron Estate DrSuite 628    4622  North Victoriachester  Northern Territory  Australia
142  143  fulan 143  Prefer not to say  80  87 Hahn Station StSuite 943        8254  New Ella               Victoria            Australia
154  155  fulan 155  Male               80  85 Charles MallSuite 424           7841  Port Sophia            New South Wales     Australia
170  171  fulan 171  Prefer not to say  80  16 Boyer WaySuite 018              6226  South Gabriel          Western Australia   Australia
174  175  fulan 175  Prefer not to say  80  57 David MallSuite 596             3129  Haneton                South Australia     Australia
181  182  fulan 182  Male               80  32 Thomas CrestSuite 753           2147  Archiefurt             Queensland          Australia
235  236  fulan 236  Prefer not to say  80  64 Phillips RunApt. 722            2752  East Sienna            New South Wales     Australia
424  424  fulan 424  Prefer not to say  80  03 Grant CrestSuite 228            5743  Lake Charliemouth      Western Australia   Australia
438  438  fulan 438  Prefer not to say  80  569 Alyssa IslandApt. 766          6893  Hunterland             Western Australia   Australia
495  495  fulan 495  Male               80  1798 Schultz MewsApt. 704          9409  Lake Caitlin           New South Wales     Australia
524  524  fulan 524  Prefer not to say  80  0358 Ashley WayApt. 506            3345  Port Sebastianland     Queensland          Australia
598  597  fulan 597  Prefer not to say  80  78 O'hara CircuitApt. 096          1966  Lake Michaelbury       South Australia     Australia
703  702  fulan 702  Prefer not to say  80  61 Bosco WaySuite 775               685  Thompsonborough        Western Australia   Australia
734  732  fulan 732  Prefer not to say  80  905 Stephanie BoulevardApt. 217    8114  Port Aaronton          Queensland          Australia
---  ---  ---------  -----------------  --  ---------------------------------  ----  ---------------------  ------------------  ---------

       customer_id          age     zip_code
count  1001.000000  1001.000000  1001.000000
mean    500.942058    49.874126  5000.693307
std     289.013599    17.644663  2886.084454
min       1.000000    20.000000     2.000000
25%     251.000000    34.000000  2398.000000
50%     501.000000    50.000000  5079.000000
75%     751.000000    65.000000  7454.000000
max    1000.000000    80.000000  9998.000000

#### Membersihkan Data orders_df

In [21]:
datetime_columns = ["order_date", "delivery_date"]

orders_df[["order_date", "delivery_date"]].info()
for column in datetime_columns:
  orders_df[column] = pd.to_datetime(orders_df[column])
print("="*60)
orders_df[["order_date", "delivery_date"]].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   order_date     1000 non-null   object
 1   delivery_date  1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB
============================================================
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   order_date     1000 non-null   datetime64[ns]
 1   delivery_date  1000 non-null   datetime64[ns]
dtypes: datetime64[ns](2)
memory usage: 15.8 KB

#### Membersihkan Data product_df

In [22]:
print("Jumlah duplikasi: ", product_df.duplicated().sum())
product_df.drop_duplicates(inplace=True)
print("Jumlah duplikasi: ", product_df.duplicated().sum())

Jumlah duplikasi:  6
Jumlah duplikasi:  0

#### Membersihkan Data sales_df

In [23]:
# Menampilkan record dengan total price NaN
# sales_df[sales_df.total_price.isna()]

print(sales_df[sales_df.total_price.isna()].shape)
# nilai total_price merupakan hasil perkalian antara price_per_unit dan quantity.
sales_df["total_price"] = sales_df["price_per_unit"] * sales_df["quantity"]
print(sales_df[sales_df.total_price.isna()].shape)

(19, 6)
(0, 6)

### Save data clean

In [24]:
path_save = 'data/clean/'
# sales_df.to_csv(path_save + 'sales_df_clean.csv', index=False)

### Menggabungkan Data

In [26]:
# Menggabungkan data customers_df dan orders_df
customers_orders_df = pd.merge(
    left=orders_df,
    right=customers_df,
    how="outer",
    left_on="customer_id",
    right_on="customer_id"
)
customers_orders_df.head(2)

,order_id,customer_id,payment,order_date,delivery_date,customer_name,gender,age,home_address,zip_code,city,state,country
0,1.0,64,30811.0,2021-08-30,2021-09-24,fulan 64,Prefer not to say,75,4927 Alice MeadowApt. 960,7787,Sanfordborough,South Australia,Australia
1,2.0,473,50490.0,2021-02-03,2021-02-13,fulan 473,Male,61,531 Schmitt BoulevardApt. 010,1744,Annaton,South Australia,Australia

In [27]:
customers_orders_df.nunique()

order_id         1000
customer_id      1000
payment           995
order_date        291
delivery_date     305
customer_name    1000
gender              3
age                61
home_address     1000
zip_code          955
city              961
state               8
country             1
dtype: int64

In [28]:
customers_orders_df.isna().sum()

order_id         384
customer_id        0
payment          384
order_date       384
delivery_date    384
customer_name      0
gender             0
age                0
home_address       0
zip_code           0
city               0
state              0
country            0
dtype: int64

In [31]:
# Menggabungkan data sales_df dan orders_df
orders_sales_df = pd.merge(
    left=sales_df,
    right=orders_df,
    how="outer",
    left_on="order_id",
    right_on="order_id"
)
orders_sales_df.head(2)

,sales_id,order_id,product_id,price_per_unit,quantity,total_price,customer_id,payment,order_date,delivery_date
0,0.0,1,218.0,106.0,2.0,212.0,64,30811,2021-08-30,2021-09-24
1,1.0,1,481.0,118.0,1.0,118.0,64,30811,2021-08-30,2021-09-24

In [32]:
orders_sales_df.isna().sum()

sales_id          7
order_id          0
product_id        7
price_per_unit    7
quantity          7
total_price       7
customer_id       0
payment           0
order_date        0
delivery_date     0
dtype: int64

In [35]:
# Menggabungkan data sales_df dan product_df
product_sales_df = pd.merge(
    left=sales_df,
    right=product_df,
    how="outer",
    left_on="product_id",
    right_on="product_id"
)
product_sales_df.head(2)

,sales_id,order_id,product_id,price_per_unit,quantity_x,total_price,product_type,product_name,size,colour,price,quantity_y,description
0,0.0,1.0,218,106.0,2.0,212.0,Shirt,Chambray,L,orange,105,44,"A orange coloured, L sized, Chambray Shirt"
1,1129.0,233.0,218,106.0,3.0,318.0,Shirt,Chambray,L,orange,105,44,"A orange coloured, L sized, Chambray Shirt"

In [36]:
product_sales_df.isna().sum()

sales_id          27
order_id          27
product_id         0
price_per_unit    27
quantity_x        27
total_price       27
product_type       0
product_name       0
size               0
colour             0
price              0
quantity_y         0
description        0
dtype: int64